import { Ingredient } from "@prisma/client";
import { PizzaSize } from "../constants/pizza";

export const getIngredientPrice = (
  ingredient: Ingredient,
  size: PizzaSize
): number => {
  const basePrice = ingredient.price;

  const sizeBasedPrices: Record<string, Record<PizzaSize, number>> = {
    "Пряная говядина": {
      20: 59,
      25: 99,
      30: 119,
      35: 155,
    },
    Моцарелла: {
      20: 55,
      25: 79,
      30: 90,
      35: 115,
    },
    "Сыры чеддер и пармезан": {
      20: 49,
      25: 69,
      30: 79,
      35: 99,
    },
    "Сыр блю чиз": {
      20: 59,
      25: 99,
      30: 149,
      35: 199,
    },
    "Острый перец халапеньо": {
      20: 39,
      25: 49,
      30: 59,
      35: 79,
    },
    "Нежный цыпленок": {
      20: 49,
      25: 69,
      30: 79,
      35: 99,
    },
    Шампиньоны: {
      20: 39,
      25: 49,
      30: 59,
      35: 79,
    },
    Бекон: {
      20: 49,
      25: 69,
      30: 79,
      35: 99,
    },
    Ветчина: {
      20: 49,
      25: 79,
      30: 79,
      35: 99,
    },
    "Пикантная пепперони": {
      20: 59,
      25: 69,
      30: 79,
      35: 99,
    },
    "Острая чоризо": {
      20: 49,
      25: 69,
      30: 79,
      35: 99,
    },
    "Маринованные огурчики": {
      20: 39,
      25: 49,
      30: 59,
      35: 79,
    },
    "Свежие томаты": {
      20: 39,
      25: 49,
      30: 59,
      35: 79,
    },
    "Красный лук": {
      20: 39,
      25: 49,
      30: 59,
      35: 79,
    },
    "Сочные ананасы": {
      20: 39,
      25: 59,
      30: 79,
      35: 79,
    },
    "Итальянские травы": {
      20: 19,
      25: 29,
      30: 39,
      35: 59,
    },
    "Сладкий перец": {
      20: 39,
      25: 49,
      30: 59,
      35: 79,
    },
    "Кубики брынзы": {
      20: 49,
      25: 69,
      30: 79,
      35: 99,
    },
    "Баварские колбаски": {
      20: 59,
      25: 119,
      30: 129,
      35: 159,
    },
    Креветки: {
      20: 115,
      25: 205,
      30: 229,
      35: 250,
    },
    "Свиная шейка": {
      20: 115,
      25: 205,
      30: 229,
      35: 250,
    },
    "Сырный бортик": {
      20: 0,
      25: 0,
      30: 205,
      35: 229,
    },
  };

  const sizePrices = sizeBasedPrices[ingredient.name];
  if (sizePrices) {
    return sizePrices[size] || basePrice;
  }

  return basePrice;
};
