import { Ingredient } from "@prisma/client";
import { PizzaSize } from "../constants/pizza";

export const getIngredientPrice = (
  ingredient: Ingredient,
  size: PizzaSize
): number => {
  const sizeBasedPrices: Record<string, Record<PizzaSize, number>> = {
    "Сырный бортик": { 25: 0, 30: 5.5, 35: 5.9 },
    "Пряная говядина": { 25: 3.5, 30: 4.0, 35: 5.0 },
    Моцарелла: { 25: 3.0, 30: 3.5, 35: 5.0 },
    "Сыры чеддер и пармезан": { 25: 3.0, 30: 3.5, 35: 4.0 },
    "Сыр блю чиз": { 25: 3.0, 30: 3.5, 35: 5.0 },
    "Острый перец халапеньо": { 25: 2.0, 30: 2.5, 35: 3.0 },
    "Нежный цыпленок": { 25: 2.5, 30: 3.0, 35: 3.5 },
    Шампиньоны: { 25: 2.0, 30: 2.5, 35: 3.0 },
    Бекон: { 25: 3.0, 30: 3.5, 35: 4.0 },
    Ветчина: { 25: 2.5, 30: 3.0, 35: 3.5 },
    "Пикантная пепперони": { 25: 2.5, 30: 3.0, 35: 3.5 },
    "Острая чоризо": { 25: 2.5, 30: 3.0, 35: 3.5 },
    "Маринованные огурчики": { 25: 2.0, 30: 2.5, 35: 3.0 },
    "Свежие томаты": { 25: 2.5, 30: 3.0, 35: 3.5 },
    "Красный лук": { 25: 2.0, 30: 2.5, 35: 3.0 },
    "Сочные ананасы": { 25: 2.5, 30: 3.0, 35: 3.5 },
    "Итальянские травы": { 25: 2.0, 30: 2.5, 35: 3.0 },
    "Сладкий перец": { 25: 1.99, 30: 2.49, 35: 2.99 },
    "Кубики брынзы": { 25: 2.5, 30: 3.0, 35: 3.5 },
    "Баварские колбаски": { 25: 4.0, 30: 4.5, 35: 5.5 },
    Креветки: { 25: 7.0, 30: 8.0, 35: 9.0 },
    "Свиная шейка": { 25: 7.0, 30: 8.0, 35: 9.0 },
  };

  const sizePrices = sizeBasedPrices[ingredient.name];
  if (sizePrices) {
    return sizePrices[size];
  }

  return ingredient.price;
};
